CREATE DATABASE  IF NOT EXISTS `bookmark` /*!40100 DEFAULT CHARACTER SET utf8 */;
USE `bookmark`;
-- MySQL dump 10.13  Distrib 5.7.17, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: bookmark
-- ------------------------------------------------------
-- Server version	8.0.0-dmr-log

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `patent_law`
--

DROP TABLE IF EXISTS `patent_law`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `patent_law` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `original` text NOT NULL,
  `translation` text,
  `mark` text,
  `comment` text,
  `remark` text,
  `time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `location` text,
  `author` text,
  `device` text,
  `image` text COMMENT 'image URL',
  `audio` text COMMENT 'audio URL',
  `vedio` text COMMENT 'audio URL',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=41 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `patent_law`
--

LOCK TABLES `patent_law` WRITE;
/*!40000 ALTER TABLE `patent_law` DISABLE KEYS */;
INSERT INTO `patent_law` VALUES (1,'中华人民共和国专利法','','\r\n中华人民共和国主席令\r\n\r\n第 八号\r\n\r\n《全国人民代表大会常务委员会关于修改〈中华人民共和国专利法〉的决定》已由中华人民共和国第十一届全国人民代表大会常务委员会第六次会议于2008年12月27日通过，现予公布，自2009年10月1日起施行。\r\n\r\n中华人民共和国主席胡锦涛\r\n\r\n2008年12月27日\r\n\r\n（1984年3月12日第六届全国人民代表大会常务委员会第四次会议通过根据1992年9月4日第七届全国人民代表大会常务委员会第二十七次会议《关于修改〈中华人民共和国专利法〉的决定》第一次修正根据2000年8月25日第九届全国人民代表大会常务委员会第十七次会议《关于修改〈中华人民共和国专利法〉的决定》第二次修正根据2008年12月27日第十一届全国人民代表大会常务委员会第六次会议《关于修改〈中华人民共和国专利法〉的决定》第三次修正）','','','2017-04-21 01:35:51','china','','','','',''),(2,'目 录','','目 录\r\n\r\n第一章 总则\r\n\r\n第二章 授予专利权的条件\r\n\r\n第三章 专利的申请\r\n\r\n第四章专利申请的审查和批准\r\n\r\n第五章专利权的期限、终止和无效\r\n\r\n第六章专利实施的强制许可\r\n\r\n第七章 专利权的保护\r\n\r\n第八章 附则','','','2017-04-21 01:38:39','china','','','','',''),(3,'第一章 总 则\r\n','','第一条为了保护专利权人的合法权益，鼓励发明创造，推动发明创造的应用，提高创新能力，促进科学技术进步和经济社会发展，制定本法。\r\n','保护+鼓励+推动+提高+促进+制定.','','2017-04-21 01:40:39','china','','','','',''),(4,'第一章 总 则\r\n','','第二条本法所称的发明创造是指发明、实用新型和外观设计。\r\n\r\n发明，是指对产品、方法或者其改进所提出的新的技术方案。\r\n\r\n实用新型，是指对产品的形状、构造或者其结合所提出的适于实用的新的技术方案。\r\n\r\n外观设计，是指对产品的形状、图案或者其结合以及色彩与形状、图案的结合所作出的富有美感并适于工业应用的新设计。','发明创造类型:发明+实用新型+外观设计.','','2017-04-21 01:41:57','china','','','','',''),(5,'第一章 总 则\r\n','','第三条国务院专利行政部门负责管理全国的专利工作；统一受理和审查专利申请，依法授予专利权。\r\n省、自治区、直辖市人民政府管理专利工作的部门负责本行政区域内的专利管理工作。','全国:国务院专利行政部门 .地方:省、自治区、直辖市人民政府管理专利工作的部门.','','2017-04-21 01:43:51','china','','','','',''),(6,'第一章 总 则\r\n','','第四条申请专利的发明创造涉及国家安全或者重大利益需要保密的，按照国家有关规定办理。\r\n','checklist_item:申请专利的发明创造涉及国家安全或者重大利益需要保密','','2017-04-21 01:45:07','china','','','','',''),(7,'第一章 总 则\r\n','','五条对违反法律、社会公德或者妨害公共利益的发明创造，不授予专利权。\r\n对违反法律、行政法规的规定获取或者利用遗传资源，并依赖该遗传资源完成的发明创造，不授予专利权。\r\n','checklist_item:\r\n违反法律、社会公德或者妨害公共利益的发明创造. \r\n对违反法律、行政法规的规定获取或者利用遗传资源，并依赖该遗传资源完成的发明创造\r\nY:reject N:goon','','2017-04-21 01:46:40','china','','','','',''),(8,'第一章 总 则\r\n','','第六条 执行本单位的任务或者主要是利用本单位的物质技术条件所完成的发明创造为职务发明创造。\r\n职务发明创造申请专利的权利属于该单位；申请被批准后，该单位为专利权人。\r\n非职务发明创造，申请专利的权利属于发明人或者设计人；\r\n申请被批准后，该发明人或者设计人为专利权人。\r\n利用本单位的物质技术条件所完成的发明创造，\r\n单位与发明人或者设计人订有合同，对申请专利的权利和专利权的归属作出约定的，从其约定。','是否为职务发明创造:\r\nchecklist_item:\r\n执行本单位的任务或者主要是利用本单位的物质技术条件所完成的发明创造\r\nY:职务发明创造申请专利的权利属于该单位；申请被批准后，该单位为专利权人\r\nN:专利的权利属于发明人或者设计人；','','2017-04-21 01:53:34','china','','','','',''),(9,'第一章 总 则\r\n','','第七条 对发明人或者设计人的非职务发明创造专利申请，任何单位或者个人不得压制。','check_item:非职务发明创造专利申请，单位或者个人是否有存在压制问题。:\r\nY: go to report warning. \r\nN: go on .','','2017-04-21 01:56:12','china','','','','',''),(10,'第一章 总 则\r\n','','第八条 两个以上单位或者个人合作完成的发明创造、一个单位或者个人接受其他单位或者个人委托所完成的发明创造，除另有协议的以外，申请专利的权利属于完成或者共同完成的单位或者个人；申请被批准后，申请的单位或者个人为专利权人。\r\n','check_item:是否为两个及两个以上合作完成发明创造? \r\ncheck_item:是否为一个单位或者个人接受其他单位或者个人委托所完成的发明创造?\r\nY: 申请专利的权利属于完成或者共同完成的单位或者个人 \r\n','','2017-04-21 01:58:49','china','','','','',''),(11,'第一章 总 则\r\n','','第九条同样的发明创造只能授予一项专利权。但是，同一申请人同日对同样的发明创造既申请实用新型专利又申请发明专利，先获得的实用新型专利权尚未终止，且申请人声明放弃该实用新型专利权的，可以授予发明专利权。两个以上的申请人分别就同样的发明创造申请专利的，专利权授予最先申请的人。\r\n','check_item:是否存在同样的发明创造? \r\ncheck_item:是否为同一申请人同日对同样的发明创造既申请实用新型专利又申请发明专利?\r\ncheck_item:先获得的实用新型专利权尚未终止是否终止?\r\n{check_item:申请人声明放弃该实用新型专利权的是否放弃实用新型专利权?Y:可以授予发明专利权}\r\ncheck_item:是否存在两个以上的申请人分别就同样的发明创造申请专利的，Y: ?专利权授予最先: 申请的人。\r\n','','2017-04-21 02:03:45','china','','','','',''),(12,'第一章 总 则','','第十条 专利申请权和专利权可以转让。中国单位或者个人向外国人、外国企业或者外国其他组织转让专利申请权或者专利权的，应当依照有关法律、行政法规的规定办理手续。转让专利申请权或者专利权的，当事人应当订立书面合同，并向国务院专利行政部门登记，由国务院专利行政部门予以公告。专利申请权或者专利权的转让自登记之日起生效。','object:国单位或者个人向外国人、外国企业或者外国其他组织\r\naction:申请：转让专利权和申请权; 转让:办理手续 ;登记:国务院专利行政部门;公告：国务院专利行政部门; 生效：时间\r\noutput:书面合同','','2017-04-23 12:36:05','china','','','','',''),(13,'第一章 总 则','','第十一条发明和实用新型专利权被授予后，除本法另有规定的以外，任何单位或者个人未经专利权人许可，都不得实施其专利，即不得为生产经营目的制造、使用、许诺销售、销售、进口其专利产品，或者使用其专利方法以及使用、许诺销售、销售、进口依照该专利方法直接获得的产品。\r\n\r\n外观设计专利权被授予后，任何单位或者个人未经专利权人许可，都不得实施其专利，即不得为生产经营目的制造、许诺销售、销售、进口其外观设计专利产品。','action: 实施专利执法检查','','2017-04-23 13:32:16','china','','','','',''),(14,'第一章 总 则','','第十二条任何单位或者个人实施他人专利的，应当与专利权人订立实施许可合同，向专利权人支付专利使用费。被许可人无权允许合同规定以外的任何单位或者个人实施该专利。\r\n','object:单位，个人\r\naction:申请：实施专利 ，签订：实施专利合同 支付：专利权人费用','','2017-04-23 13:36:16','china','','','','',''),(15,'第一章 总 则','','第十三条发明专利申请公布后，申请人可以要求实施其发明的单位或者个人支付适当的费用。\r\n','object:申请人（单位，个人）\r\naction:要求：实施专利支付费用 签订：实施专利合同 支付：专利权人费用','','2017-04-23 13:45:28','china','','','','',''),(16,'第一章 总 则','','第十四条国有企业事业单位的发明专利，对国家利益或者公共利益具有重大意义的，国务院有关主管部门和省、自治区、直辖市人民政府报经国务院批准，可以决定在批准的范围内推广应用，允许指定的单位实施，由实施单位按照国家规定向专利权人支付使用费。','','','2017-04-23 15:34:18','china','','','','',''),(17,'第一章 总 则','','第十五条专利申请权或者专利权的共有人对权利的行使有约定的，从其约定。没有约定的，共有人可以单独实施或者以普通许可方式许可他人实施该专利；许可他人实施该专利的，收取的使用费应当在共有人之间分配。\r\n除前款规定的情形外，行使共有的专利申请权或者专利权应当取得全体共有人的同意。','action:确认：共有人共同确认许可和实施。','','2017-04-23 15:38:38','china','','','','',''),(18,'第一章 总 则','','第十六条被授予专利权的单位应当对职务发明创造的发明人或者设计人给予奖励；发明创造专利实施后，根据其推广应用的范围和取得的经济效益，对发明人或者设计人给予合理的报酬。\r\n','object:被授予专利权的单位\r\naction:奖励：职务发明创造的发明人或者设计人给予奖。支付：根据经济效益对发明人或者设计人给予合理的报酬','','2017-04-23 15:43:28','china','','','','',''),(19,'第一章 总 则','','第十七条发明人或者设计人有权在专利文件中写明自己是发明人或者设计人。\r\n\r\n专利权人有权在其专利产品或者该产品的包装上标明专利标识。\n','object:发明人或者设计人\r\naction:署名：在专利文件中写明自己是发明人或者设计人','','2017-04-23 15:45:40','china','','','','',''),(20,'第一章 总 则','','第十八条在中国没有经常居所或者营业所的外国人、外国企业或者外国其他组织在中国申请专利的，依照其所属国同中国签订的协议或者共同参加的国际条约，或者依照互惠原则，根据本法办理。\r\n\r\n','object:外国人、外国企业或者外国其他组织\r\naction:申请：依据','','2017-04-23 15:51:04','china','','','','',''),(21,'第一章 总 则','','第十九条在中国没有经常居所或者营业所的外国人、外国企业或者外国其他组织在中国申请专利和办理其他专利事务的，应当委托依法设立的专利代理机构办理。\r\n\r\n中国单位或者个人在国内申请专利和办理其他专利事务的，可以委托依法设立的专利代理机构办理。\r\n\r\n专利代理机构应当遵守法律、行政法规，按照被代理人的委托办理专利申请或者其他专利事务；对被代理人发明创造的内容，除专利申请已经公布或者公告的以外，负有保密责任。专利代理机构的具体管理办法由国务院规定。\r\n\r\n','action：委托','','2017-04-23 16:25:03','china','','','','',''),(22,'第一章 总 则','','第二十条任何单位或者个人将在中国完成的发明或者实用新型向外国申请专利的，应当事先报经国务院专利行政部门进行保密审查。保密审查的程序、期限等按照国务院的规定执行。\r\n\r\n中国单位或者个人可以根据中华人民共和国参加的有关国际条约提出专利国际申请。申请人提出专利国际申请的，应当遵守前款规定。\r\n\r\n国务院专利行政部门依照中华人民共和国参加的有关国际条约、本法和国务院有关规定处理专利国际申请。\r\n\r\n对违反本条第一款规定向外国申请专利的发明或者实用新型，在中国申请专利的，不授予专利权。','object:任何单位或者个人\r\naction：外国申请专利;保密审查;国际申请;','','2017-04-23 16:28:42','china','','','','',''),(23,'第一章 总 则','','第二十一条国务院专利行政部门及其专利复审委员会应当按照客观、公正、准确、及时的要求，依法处理有关专利的申请和请求。\r\n\r\n国务院专利行政部门应当完整、准确、及时发布专利信息，定期出版专利公报。\r\n\r\n在专利申请公布或者公告前，国务院专利行政部门的工作人员及有关人员对其内容负有保密责任。','object:务院专利行政部门及其专利复审委员会\r\naction：申请和请求;发布专利信息;保密责任;','','2017-04-23 16:32:02','china','','','','',''),(24,'第二章 授予专利权的条件','','第二章 授予专利权的条件','object:务院专利行政部门\r\naction：授予专利权;','','2017-04-23 16:33:52','china','','','','',''),(25,'第二章 授予专利权的条件','','第二十二条授予专利权的发明和实用新型，应当具备新颖性、创造性和实用性。\r\n\r\n新颖性，是指该发明或者实用新型不属于现有技术；也没有任何单位或者个人就同样的发明或者实用新型在申请日以前向国务院专利行政部门提出过申请，并记载在申请日以后公布的专利申请文件或者公告的专利文件中。\r\n\r\n创造性，是指与现有技术相比，该发明具有突出的实质性特点和显著的进步，该实用新型具有实质性特点和进步。\r\n\r\n实用性，是指该发明或者实用新型能够制造或者使用，并且能够产生积极效果。\r\n\r\n本法所称现有技术，是指申请日以前在国内外为公众所知的技术。','object:务院专利行政部门\r\naction：check:发明和实用新型，应当具备新颖性、创造性和实用性。','','2017-04-23 16:34:57','china','','','','',''),(26,'第二章 授予专利权的条件','','第二十三条授予专利权的外观设计，应当不属于现有设计；也没有任何单位或者个人就同样的外观设计在申请日以前向国务院专利行政部门提出过申请，并记载在申请日以后公告的专利文件中。\r\n\r\n授予专利权的外观设计与现有设计或者现有设计特征的组合相比，应当具有明显区别。\r\n\r\n授予专利权的外观设计不得与他人在申请日以前已经取得的合法权利相冲突。\r\n\r\n本法所称现有设计，是指申请日以前在国内外为公众所知的设计。','object:务院专利行政部门\r\naction：check:外观设计，不属于现有设计;已有同样专利提出过申请;有明显区别;\r\n与他人在申请日以前已经取得的合法权利相冲突。\r\n','','2017-04-23 16:39:12','china','','','','',''),(27,'第二章 授予专利权的条件','','第二十四条申请专利的发明创造在申请日以前六个月内，有下列情形之一的，不丧失新颖性：\r\n\r\n（一）在中国政府主办或者承认的国际展览会上首次展出的；\r\n\r\n（二）在规定的学术会议或者技术会议上首次发表的；\r\n\r\n（三）他人未经申请人同意而泄露其内容的。\r\n','object:务院专利行政部门\r\naction：check:不丧失新颖性情况。\r\n','','2017-04-23 16:44:23','china','','','','',''),(28,'第二章 授予专利权的条件','','第二十四条申请专利的发明创造在申请日以前六个月内，有下列情形之一的，不丧失新颖性：\r\n\r\n（一）在中国政府主办或者承认的国际展览会上首次展出的；\r\n\r\n（二）在规定的学术会议或者技术会议上首次发表的；\r\n\r\n（三）他人未经申请人同意而泄露其内容的。\r\n','object:务院专利行政部门\r\naction：check:不丧失新颖性情况。\r\n','','2017-04-23 16:46:19','china','','','','',''),(29,'第二章 授予专利权的条件','','第二十五条对下列各项，不授予专利权：\r\n（一）科学发现；\r\n（二）智力活动的规则和方法；\r\n（三）疾病的诊断和治疗方法；\r\n（四）动物和植物品种；\r\n（五）用原子核变换方法获得的物质；\r\n（六）对平面印刷品的图案、色彩或者二者的结合作出的主要起标识作用的设计。\r\n\r\n对前款第（四）项所列产品的生产方法，可以依照本法规定授予专利权。','action:check:+ reject 1,2,3,4,5,6 ','','2017-04-24 03:30:31','china','','','','',''),(30,'第三章 专利的申请','','第二十六条申请发明或者实用新型专利的，应当提交请求书、说明书及其摘要和权利要求书等文件。\r\n\r\n请求书应当写明发明或者实用新型的名称，发明人的姓名，申请人姓名或者名称、地址，以及其他事项。\r\n\r\n说明书应当对发明或者实用新型作出清楚、完整的说明，以所属技术领域的技术人员能够实现为准；必要的时候，应当有附图。摘要应当简要说明发明或者实用新型的技术要点。\r\n\r\n权利要求书应当以说明书为依据，清楚、简要地限定要求专利保护的范围。\r\n\r\n依赖遗传资源完成的发明创造，申请人应当在专利申请文件中说明该遗传资源的直接来源和原始来源；申请人无法说明原始来源的，应当陈述理由。','action:申请: 提交:交请求书、说明书以及摘要,权利要求书, write:实用新型的名称，发明人的姓名，申请人姓名或者名称、地址\r\n\r\ncheck formar:请求书,说明书,权利要求书','','2017-04-24 03:34:49','china','','','','',''),(31,'第三章 专利的申请','','第二十七条申请外观设计专利的，应当提交请求书、该外观设计的图片或者照片以及对该外观设计的简要说明等文件。\r\n\r\n申请人提交的有关图片或者照片应当清楚地显示要求专利保护的产品的外观设计。','check format:请求书,外观设计的图片或者照片,外观设计的简要说明','','2017-04-24 03:36:24','china','','','','',''),(32,'第三章 专利的申请','','第二十八条国务院专利行政部门收到专利申请文件之日为申请日。如果申请文件是邮寄的，以寄出的邮戳日为申请日。\r\n','action:record 申请日','','2017-04-24 03:37:16','china','','','','',''),(33,'第三章 专利的申请','','第二十九条申请人自发明或者实用新型在外国第一次提出专利申请之日起十二个月内，或者自外观设计在外国第一次提出专利申请之日起六个月内，又在中国就相同主题提出专利申请的，依照该外国同中国签订的协议或者共同参加的国际条约，或者依照相互承认优先权的原则，可以享有优先权。\r\n\r\n申请人自发明或者实用新型在中国第一次提出专利申请之日起十二个月内，又向国务院专利行政部门就相同主题提出专利申请的，可以享有优先权。\r\n','action:check country 外国,check :优先权','','2017-04-24 03:38:59','china','','','','',''),(34,'第三章 专利的申请','','第三十条申请人要求优先权的，应当在申请的时候提出书面声明，并且在三个月内提交第一次提出的专利申请文件的副本；未提出书面声明或者逾期未提交专利申请文件副本的，视为未要求优先权。\r\n\r\n\r\n申请人自发明或者实用新型在中国第一次提出专利申请之日起十二个月内，又向国务院专利行政部门就相同主题提出专利申请的，可以享有优先权。\r\n','action:check :优先权书面声明,check 第一次提出的专利申请文件的副本','','2017-04-24 03:39:56','china','','','','',''),(35,'第三章 专利的申请','','第三十一条一件发明或者实用新型专利申请应当限于一项发明或者实用新型。属于一个总的发明构思的两项以上的发明或者实用新型，可以作为一件申请提出。\r\n\r\n一件外观设计专利申请应当限于一项外观设计。同一产品两项以上的相似外观设计，或者用于同一类别并且成套出售或者使用的产品的两项以上外观设计，可以作为一件申请提出。\r\n\r\n\r\n申请人自发明或者实用新型在中国第一次提出专利申请之日起十二个月内，又向国务院专利行政部门就相同主题提出专利申请的，可以享有优先权。\r\n','action:check :一次申请仅限一项发明或者实用新型,外观设计,check 优先权','','2017-04-24 03:42:06','china','','','','',''),(36,'第三章 专利的申请','','第三十二条申请人可以在被授予专利权之前随时撤回其专利申请。\r\n','action:撤回专利申请 .','','2017-04-24 03:42:49','china','','','','',''),(37,'第三章 专利的申请','','第三十三条申请人可以对其专利申请文件进行修改，但是，对发明和实用新型专利申请文件的修改不得超出原说明书和权利要求书记载的范围，对外观设计专利申请文件的修改不得超出原图片或者照片表示的范围。\r\n\r\n','action:文件修改:check 修改是否超出原申请范围 .','','2017-04-24 03:44:10','china','','','','',''),(38,'\r\n第四章专利申请的审查和批准','','\r\n第四章专利申请的审查和批准','','','2017-04-24 03:44:37','china','','','','',''),(39,'\r\n第四章专利申请的审查和批准','','第三十四条国务院专利行政部门收到发明专利申请后，经初步审查认为符合本法要求的，自申请日起满十八个月，即行公布。国务院专利行政部门可以根据申请人的请求早日公布其申请。\r\n','action:公布:自申请日起满十八个月，即行公布,早日公布:请求书. 申请人的请求早日公布其申请','','2017-04-24 03:45:45','china','','','','',''),(40,'\r\n第四章专利申请的审查和批准','','第三十五条发明专利申请自申请日起三年内，国务院专利行政部门可以根据申请人随时提出的请求，对其申请进行实质审查；申请人无正当理由逾期不请求实质审查的，该申请即被视为撤回。\r\n\r\n国务院专利行政部门认为必要的时候，可以自行对发明专利申请进行实质审查。','action:实质审查:自行对发明专利申请进行实质审查,撤回','','2017-04-24 03:47:14','china','','','','','');
/*!40000 ALTER TABLE `patent_law` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `patent_law_implementation_rules`
--

DROP TABLE IF EXISTS `patent_law_implementation_rules`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `patent_law_implementation_rules` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `original` text NOT NULL,
  `translation` text,
  `mark` text,
  `comment` text,
  `remark` text,
  `time` datetime NOT NULL,
  `location` text,
  `author` text,
  `device` text,
  `image` text COMMENT 'image URL',
  `audio` text COMMENT 'audio URL',
  `vedio` text COMMENT 'vedio URL',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `patent_law_implementation_rules`
--

LOCK TABLES `patent_law_implementation_rules` WRITE;
/*!40000 ALTER TABLE `patent_law_implementation_rules` DISABLE KEYS */;
/*!40000 ALTER TABLE `patent_law_implementation_rules` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping routines for database 'bookmark'
--
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2017-04-24 17:30:06
